# BuiltInFailures.StairRampFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures Class
BuiltInFailures Class Members See Also
---
Failures about StairRamp.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class StairRampFailures
```

Visual Basic
---
```text
Public NotInheritable Class StairRampFailures
```

Visual C++
---
```text
public ref class StairRampFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..StairRampFailures
# See Also
BuiltInFailures..::..StairRampFailures Members
Autodesk.Revit.DB Namespace